&НаКлиенте
Процедура ОбновитьФильм(Команда)
	ОбновитьФильмСерверНачало();
КонецПроцедуры

&НаСервере
Процедура ОбновитьФильмСерверНачало()
	Если КинопоискID = "" или ЗначениеЗаполнено(Кино) Тогда
		Возврат;
	КонецЕсли;		
	ОбновитьФильмНаСервере(?(КинопоискID = "", Кино.КодКинопоиск,КинопоискID));	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФильмНаСервере(Код)
	
	АдресСервера = "kinopoiskapiunofficial.tech";
	api = "api/v2.2/films/" + Код;
	HTTPЗапрос = Новый HTTPЗапрос;                                                               
	HTTPЗапрос.АдресРесурса = api;
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", API_KEY);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	ОшибкаСообщение = "";
	Ошибка = Ложь;	
	Попытка 
		ОтветHTTP = Соединение.Получить(HTTPЗапрос)
	Исключение
		Попытка
			ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			ОшибкаСообщение = ОписаниеОшибки() + Символы.ПС;
			Сообщить(ОшибкаСообщение);
			Ошибка = Истина;
		КонецПопытки;
	КонецПопытки;
	
	Если НЕ Ошибка Тогда
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();					
		Попытка
			Если НЕ ЗначениеЗаполнено(Кино) Тогда
				ОбновитьДанныеФильма(Ответ);
			КонецЕсли;
		Исключение КонецПопытки;
	КонецЕсли; 
	ОтветСервера = ОшибкаСообщение + Символы.ПС + Ответ;
	
КонецПроцедуры 

&НаСервере
Функция НайтиСоздатьСтрану(НазваниеСтраны)
	Страна = Справочники.Страны.НайтиПоНаименованию(НазваниеСтраны);
	Если страна.Пустая() Тогда
		об = Справочники.Страны.СоздатьЭлемент();
		Об.Наименование = НазваниеСтраны;
		об.Записать();
		Страна = об.Ссылка;
	КонецЕсли;
	Возврат Страна;
КонецФункции

&НаСервере
Функция НайтиСоздатьЖанр(НазваниеЖанра)
	Жанр = Справочники.Жанры.НайтиПоНаименованию(НазваниеЖанра);
	Если Жанр.Пустая() Тогда
		об = Справочники.Жанры.СоздатьЭлемент();
		Об.Наименование = НазваниеЖанра;
		об.Записать();
		Жанр = об.Ссылка;
	КонецЕсли;
	Возврат Жанр;
КонецФункции

&НаСервере
Процедура ОбновитьДанныеФильма(json)
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(json);
	
	Данные = ПрочитатьJson(ЧтениеJson);
	
	Об = Кино.ПолучитьОбъект();
	Об.Наименование = ?(Данные.nameRu = Неопределено или Данные.nameRu = "", Данные.nameOriginal,Данные.nameRu);
	Об.КодIMDB = Данные.imdbId;
	Об.Описание = Данные.description;
	Об.ГодВыпуска = Данные;	
	Об.ОригинальноеНазвание = Данные.nameOriginal;
	Об.ГодВыпуска = Формат(Данные.year, "ЧГ=100");
	Об.Страны.Очистить();
	Для каждого стрСтраны Из Данные.countries ЦИкл
		стр = Об.Страны.Добавить();
		стр.Страна = НайтиСоздатьСтрану(стрСтраны.country);	
	КонецЦикла;	
	
	Об.Жанры.Очистить();
	Для каждого стрСтраны Из Данные.genres ЦИкл
		стр = Об.Жанры.Добавить();
		стр.Жанр = НайтиСоздатьЖанр(стрСтраны.genre);	
	КонецЦикла;
	
	Если Данные.type = "FILM" ТОгда 	
		Об.Тип = Перечисления.ТипКино.Фильм;
	ИначеЕсли Данные.type = "TV_SERIES" ТОгда
		Об.Тип = Перечисления.ТипКино.Сериал; 
		Об.ГодОкончания = Формат(Данные.endYear, "ЧГ=100");
	КонецЕсли;	
	
	Об.Записать();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПустые(Команда)
	ОбновитьПустыеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПустыеНаСервере()
	Запрос = Новый запрос("ВЫБРАТЬ
	|	Кино.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кино КАК Кино
	|ГДЕ
	|	НЕ Кино.КодКинопоиск = """"
	|	И Кино.Наименование = """""); 
	ЗВ = Запрос.Выполнить();
	Если не ЗВ.Пустой() Тогда
		Выборка = ЗВ.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Кино = Выборка.Ссылка;
			ОбновитьФильмНаСервере(Кино.КодКинопоиск);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсё(Команда)
	ОбновитьВсёНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсёНаСервере()
	Запрос = Новый запрос("ВЫБРАТЬ
	|	Кино.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кино КАК Кино"); 
	ЗВ = Запрос.Выполнить();
	Если не ЗВ.Пустой() Тогда
		Выборка = ЗВ.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Кино = Выборка.Ссылка;
			ОбновитьФильмНаСервере(Кино.КодКинопоиск);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры



